:PROPERTIES:
:ID:       ba9f538a-c5c5-4e21-a2c9-cec8aed13e1b
:ROAM_ALIASES: "Structure and Interpretation of Computer Programs"
:END:
#+options: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil expand-links:t f:t inline:t num:nil p:nil pri:nil prop:nil
#+options: stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: SICP
#+date: <2024-05-17 Fri>
#+author: chu the pup
#+email: chu@dogboner.xyz
#+description: 20221206014026-sicp.org
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.3 (Org mode 9.7)
#+cite_export:
**** DONE Ex. 1.2
:PROPERTIES:
:ID:       22007071-eaca-4d9e-b88f-ef21cf5759eb
:END:

#+begin_quote
*Exercise 1.2:* Translate the following expression into prefix
form.

     5 + 4 + (2 - (3 - (6 + 4/5)))
     -----------------------------
            3(6 - 2)(2 - 7)
#+end_quote

#+begin_src racket :lang sicp
(/ (+ 5 4 (- 2 (- 3 (+ 6 4/5)))) (* 3 (- 6 2) (- 2 7)))
#+end_src

#+RESULTS:
: -37/150

**** DONE Ex. 1.3
:PROPERTIES:
:ID:       366eb525-f202-45fe-ad71-fabdb54f3ef4
:END:

#+begin_quote
*Exercise 1.3:* Define a procedure that takes three numbers as arguments and returns the sum of the squares of the two larger numbers.
#+end_quote

| a and b are greater than c                      | sum-square a and b              |
| a and c are greater than b                      | sum-square a and c              |
| b and c are greater than a                      | sum-square b and c              |
| a is greater than both b and c, which are equal | sum-square a with either b or c |
| b is greater than both a and c, which are equal | sum-square b with either a or c |
| c is greater than both a and b, which are equal | sum-square c with either a or b |
| all three numbers are equal to one another      | sum-square any two variables    |
| all three numbers are equal to zero             | return 0 or throw an error (not implemented here) |

#+begin_src racket :lang sicp
(define (square a)
  (* a a))

(define (sum-square a b)
  (+ (square a) (square b)))

(define (fun a b c)
  (cond ((and (>= a c) (>= b c)) (sum-square a b))
        ((and (>= a b) (>= c b)) (sum-square a c))
        (else (sum-square b c))))

;; Checks
(= (fun 10 10 10) (sum-square 10 10))

(= (fun 1 10 10) (sum-square 10 10))
(= (fun 10 1 10) (sum-square 10 10))
(= (fun 10 10 1) (sum-square 10 10))

(= (fun 1 10 100) (sum-square 10 100))
(= (fun 1 100 10) (sum-square 10 100))
(= (fun 10 1 100) (sum-square 10 100))
(= (fun 10 100 1) (sum-square 10 100))
(= (fun 100 10 1) (sum-square 10 100))
(= (fun 100 1 10) (sum-square 10 100))
#+end_src

#+RESULTS:
#+begin_example
#t
#t
#t
#t
#t
#t
#t
#t
#t
#t
#+end_example

**** DONE Ex. 1.4
:PROPERTIES:
:ID:       65266087-6c19-4ac4-ba9f-07cf00529a72
:END:

#+begin_quote
*Exercise 1.4:* Observe that our model of evaluation allows for combinations whose operators are compound expressions.  Use this observation to describe the behavior of the following procedure:
#+end_quote

#+begin_src racket :lang sicp
(define (a-plus-abs-b a b)
  ((if (> b 0) + -) a b))

(a-plus-abs-b 1 -15)
#+end_src

#+RESULTS:
: 16

If ~b~ is greater than ~0~, add ~a~ and ~b~.
If ~b~ is a negative number, negate it, i.e.,:

#+begin_src racket :lang sicp
(- -15)
#+end_src

#+RESULTS:
: 15

and /then/ add ~a~ and ~b~ (which is now ~(- b)~ (which is the absolute value of ~b~)) together.

In other words, this is making use of unary operators.

**** DONE Ex. 1.6
:PROPERTIES:
:ID:       3224c89e-156e-4615-8ebe-6adcb347ed5e
:END:

#+begin_quote
*Exercise 1.6:* Alyssa P. Hacker doesn't see why `if' needs to be provided as a special form.  "Why can't I just define it as an ordinary procedure in terms of `cond'?" she asks.  Alyssa's friend Eva Lu Ator claims this can indeed be done, and she defines a new version of `if':
#+end_quote

#+begin_src racket :lang sicp
(define (new-if predicate then-clause else-clause)
  (cond (predicate then-clause)
        (else else-clause)))
#+end_src

#+begin_quote
Eva demonstrates the program for Alyssa:
#+end_quote

#+begin_src racket :lang sicp
(define (new-if predicate then-clause else-clause)
  (cond (predicate then-clause)
        (else else-clause)))

(new-if (= 2 3) 0 5)

(new-if (= 1 1) 0 5)
#+end_src

#+RESULTS:
: 5
: 0

Delighted, Alyssa uses `new-if' to rewrite the square-root program:

#+begin_src racket :lang sicp
(define (sqrt-iter guess x)
  (new-if (good-enough? guess x)
          guess
          (sqrt-iter (improve guess x)
                     x)))
#+end_src

What happens when Alyssa attempts to use this to compute square
roots?  Explain.

It creates an infinite loop. Any function supplied to new-if will be applied, sqrt-iter
then loops forever after.
**** DONE Ex. 1.8
:PROPERTIES:
:ID:       97d13728-4a5a-40ec-8af6-009c7e2a1ec7
:END:

#+begin_src racket :lang sicp
(define (average x y)
  (/ (+ (/ x (expt y 2)) (* 2 y)) 3))

(define (improve guess x)
  (average guess (/ x guess)))

(define (cube x)
  (* x x x))

(define (good-enough? guess x)
  (< (abs (- (cube guess) x)) 0.1))

(define (cbrt-iter guess x)
  (if (good-enough? guess x)
      guess
      (cbrt-iter (improve guess x)
                 x)))

(define (cbrt x)
  (cbrt-iter 1.0 x))

(cbrt 2)
#+end_src

#+RESULTS:
: 1.2680202967796828

The actual answer is 1.25992104989, but, close enough!

